Examinator/src/Catalogs/ЭлектронныеГлоссарии/ЭлектронныеГлоссарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлектронныеГлоссарии</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКоманду</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Термины</name>
    <attributes>
      <name>Термин</name>
      <type>
        <types>CatalogRef.ТерминыЭлектронныхГлоссариев</types>
      </type>
    </attributes>
    <attributes>
      <name>СоздаватьСсылки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСсылок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ТерминыЭлектронныхГлоссариев/ТерминыЭлектронныхГлоссариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерминыЭлектронныхГлоссариев</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БукваДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Определение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОпределение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Синонимы</name>
    <comment>Синонимы</comment>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БукваДляПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ЭлектронныеГлоссарии/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Возвращает группу, в которой хранятся элементы глоссария.
// В случае ее отсутствия, создает новую.
//
Функция ГруппаПодчиненныхЭлементов(Знач Глоссарий, Знач ТипПодчиненногоЭлемента, Знач ЭлектронныйРесурс = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Глоссарий)
		ИЛИ НЕ ЗначениеЗаполнено(ТипПодчиненногоЭлемента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ГруппаПодчиненныхЭлементов = РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.ГруппаДляХраненияПодчиненныхЭлементов(Глоссарий, ТипПодчиненногоЭлемента);
	
	Если ГруппаПодчиненныхЭлементов = Неопределено Тогда
		
		ИмяСправочника = Метаданные.НайтиПоТипу(ТипПодчиненногоЭлемента).Имя;
		
		НоваяГруппаОбъект =  Справочники[ИмяСправочника].СоздатьГруппу();
		НоваяГруппаОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Глоссарий, "Наименование");
	
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			НоваяГруппаОбъект.Родитель = Справочники.ЭлектронныеКурсы.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, ТипПодчиненногоЭлемента);	
		КонецЕсли;
		
		РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(НоваяГруппаОбъект);

		НоваяГруппаОбъект.Записать();
		
		ГруппаПодчиненныхЭлементов = НоваяГруппаОбъект.Ссылка;
		
		РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.СохранитьГруппуДляХраненияПодчиненныхЭлементов(Глоссарий, ГруппаПодчиненныхЭлементов);		
				
	КонецЕсли;

	Возврат ГруппаПодчиненныхЭлементов;

КонецФункции

Функция Термины(Знач Глоссарий, ВключатьПомеченныеНаУдаление = Истина, ВключатьОпределение = Ложь) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Термины.Наименование КАК Наименование,
		|	Термины.КраткоеОпределение КАК КраткоеОпределение,
		|	Термины.Ссылка КАК Термин,
		|	ТерминыГлоссария.СоздаватьСсылки КАК СоздаватьСсылки,
		|	ТерминыГлоссария.КоличествоСсылок КАК КоличествоСсылок,
		|	Термины.БукваДляПоиска КАК БукваДляПоиска,
		|	&ПутьКОпределению КАК Определение
		|ИЗ
		|	Справочник.ЭлектронныеГлоссарии.Термины КАК ТерминыГлоссария
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТерминыЭлектронныхГлоссариев КАК Термины
		|		ПО ТерминыГлоссария.Термин = Термины.Ссылка
		|ГДЕ
		|	Термины.ЭтоГруппа = ЛОЖЬ
		|	И ТерминыГлоссария.Ссылка = &Глоссарий
		|	И &ОтборПомеченныхНаУдаление";
	
	Если ВключатьПомеченныеНаУдаление Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПомеченныхНаУдаление", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПомеченныхНаУдаление", "Термины.ПометкаУдаления = ЛОЖЬ");
	КонецЕсли;
	
	Если ВключатьОпределение Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПутьКОпределению", "Термины.Определение");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПутьКОпределению", "NULL");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Глоссарий", Глоссарий);	
	
	ТаблицаТерминов = Запрос.Выполнить().Выгрузить();
	
	ТаблицаТерминов.Колонки.Добавить("Синонимы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТерминыЭлектронныхГлоссариевСинонимы.Представление КАК Представление,
		|	ТерминыЭлектронныхГлоссариевСинонимы.Ссылка КАК Термин,
		|	ТерминыЭлектронныхГлоссариевСинонимы.БукваДляПоиска КАК БукваДляПоиска
		|ИЗ
		|	Справочник.ТерминыЭлектронныхГлоссариев.Синонимы КАК ТерминыЭлектронныхГлоссариевСинонимы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭлектронныеГлоссарии.Термины КАК ЭлектронныеГлоссарииТермины
		|		ПО ТерминыЭлектронныхГлоссариевСинонимы.Ссылка = ЭлектронныеГлоссарииТермины.Термин
		|ГДЕ
		|	ЭлектронныеГлоссарииТермины.Ссылка = &Глоссарий";
	
	Запрос.УстановитьПараметр("Глоссарий", Глоссарий);
	
	ТаблицаСинонимов = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТТ Из ТаблицаТерминов Цикл
			
		Синонимы = ТаблицаСинонимов.НайтиСтроки(Новый Структура("Термин", СтрокаТТ.Термин));
		
		СтрокаТТ.Синонимы = Новый Массив;
		Для каждого СтрокаС Из Синонимы Цикл
			СтрокаТТ.Синонимы.Добавить(Новый Структура("Представление, БукваДляПоиска", СтрокаС.Представление, СтрокаС.БукваДляПоиска));
		КонецЦикла;
				
	КонецЦикла;
	
	Возврат ТаблицаТерминов;
	
КонецФункции

#КонецОбласти


#КонецЕсли
